[
  {
    "title": "Data Analyst Intern",
    "company": "Persevex",
    "score": 70,
    "reason": "Abhishek has a strong foundation in data science, machine learning, and programming with Python and SQL, which aligns well with the data analysis and AI/ML integration aspects of the role. His experience in building projects like face recognition systems and fake news detection shows hands-on technical and analytical skills relevant to Persevex's AI-powered Edtech platform. However, the role demands proficiency in JavaScript/TypeScript, React.js, Node.js, and experience with cloud platforms like AWS/GCP, along with backend and frontend development skills, which are not explicitly mentioned in his profile. Given his background and interest, with some upskilling on full-stack development and related technologies, he could successfully match this opportunity.",
    "message": "Hi! I came across the Data Analyst Intern role at Persevex and your background in data science and AI projects caught my attention. The role’s focus on AI-powered Edtech platforms seems like a great match for your skills and interests. Would you be open to discussing this exciting opportunity and how it aligns with your career goals?",
    "link": "https://www.recruit.net/job/data-analyst-intern-jobs/5EA95EC8EC414470?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Data Analyst intern",
    "company": "Signzy",
    "score": 85,
    "reason": "Abhishek's strong background in Computer Science with Data Science specialization, proficiency in Python, SQL, and Power BI, along with experience in data analysis, machine learning, and relevant projects, aligns well with the requirements for the Data Analyst Intern role at Signzy. Although there is no explicit mention of experience with R, the candidate's analytical skills and technical knowledge indicate good potential for success in the position.",
    "message": "Hi Abhishek, your experience with Python, SQL, and data analysis projects aligns well with Signzy's Data Analyst Intern role. Your background in data science and technical skills can help you thrive in our innovative fintech environment. Let's connect to explore this opportunity!",
    "link": "https://in.linkedin.com/jobs/view/data-analyst-intern-at-signzy-4324315773?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Data Analyst Intern",
    "company": "Persevex",
    "score": 70,
    "reason": "Abhishek has a strong foundation in data science, machine learning, and programming skills in Python and SQL, which align well with data analysis and AI/ML concepts required at Persevex. His experience with data analysis projects and technical skills in cloud tools demonstrate good technical foundation. However, the job specifically emphasizes full stack development skills in JavaScript/TypeScript, React.js, Node.js, and modern DevOps tools like Docker and Git, which are not mentioned in Abhishek's profile. Additionally, direct experience with web application development, APIs, and frontend frameworks appears limited. Still, his passion, analytical mindset, and familiarity with AI/ML fundamentals show potential to quickly adapt and grow in the role during the internship.",
    "message": "Hi Abhishek, I came across your profile and was impressed by your strong background in data science and machine learning. We have a Data Analyst Intern opportunity at Persevex focusing on AI-powered Edtech platforms. It’s a great chance to build full-stack skills and work with cutting edge decentralized AI systems. If you’re interested in working in a fast-paced startup and expanding your development expertise, let’s connect!",
    "link": "https://www.recruit.net/job/data-analyst-intern-jobs/68256C9A9D9EE064?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Junior Data Analyst",
    "company": "Database Report Labs",
    "score": 75,
    "reason": "Abhishek Tiwari has strong technical skills in Python, SQL, and Power BI, along with experience in data analysis, which aligns well with the Junior Data Analyst role. His background in data science projects demonstrates good data handling and analytical capability. However, as a current B.Tech student without explicit prior professional experience and with a focus on machine learning and AI, he may not fully meet the requirement of no data science or AI aspirations and the preference against freshers for this role. Still, his eagerness and relevant skills make him a strong candidate for consideration.",
    "message": "SAFFRON GREEN I am keen to join Database Report Labs as a Junior Data Analyst. My hands-on experience in SQL, Power BI, and data analysis projects equips me to contribute effectively. I am enthusiastic about working in data reporting and business intelligence and can adapt quickly to client needs across time zones. I would appreciate the opportunity to discuss how I can add value to your team.",
    "link": "https://www.recruit.net/job/junior-data-analyst-jobs/278DD6F4CE957012?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Data Analytics Intern",
    "company": "BlitzenX",
    "score": "90",
    "reason": "Abhishek's strong technical foundation in Python, SQL, and Power BI aligns well with the core requirements of the Data Analytics Intern role. His experience in machine learning, NLP, and data analysis, combined with projects like face recognition and fake news detection, demonstrates his ability to manipulate and derive insights from complex data. Additionally, his familiarity with cloud tools complements the preferred skills. The candidate shows the required analytical mindset, technical proficiency, and ability to deliver actionable insights in fast-paced environments, making him a strong fit for this role.",
    "message": "Hi Abhishek, your background in data science and hands-on experience with Python, SQL, and Power BI are a great match for a Data Analytics Intern role we have at BlitzenX. Your projects showcase strong analytical and technical skills well suited for driving actionable insights in a dynamic analytics environment. Let’s connect to discuss this opportunity!",
    "link": "https://in.linkedin.com/jobs/view/data-analytics-intern-at-blitzenx-4347399132?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Data Analytics Intern (Big query)",
    "company": "AroundAI",
    "score": 75,
    "reason": "Abhishek has strong technical skills in Python and SQL, along with experience in data analysis and cloud tools, which align well with the requirements of the Data Analytics Intern role at AroundAI. While the job emphasizes BigQuery and SQL querying for data validation and reporting, Abhishek's experience with data projects and SQL makes him a good fit. However, there is no explicit mention of prior BigQuery experience or familiarity with its UI, which slightly lowers the match score.",
    "message": "Hi Abhishek, I came across your profile and was impressed by your experience in data science and SQL. We have a Data Analytics Intern position at AroundAI that involves working with BigQuery and data validation tasks. Your skills seem like a great fit. Would you be interested in learning more?",
    "link": "https://www.glassdoor.co.in/job-listing/data-analytics-intern-big-query-aroundai-JV_KO0,31_KE32,40.htm?jl=1009948649671&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "data analyst intern",
    "company": "HUMAN INITIALS",
    "score": 85,
    "reason": "Abhishek Tiwari's strong background in data science, hands-on experience in data analysis, machine learning, and proficiency in Python, SQL, and Power BI align well with the requirements for the Data Analyst Intern role at HUMAN INITIALS. His projects demonstrate practical skills in analyzing and interpreting data, while his academic focus and self-driven projects showcase his passion and commitment to growing in data analysis. Although his experience includes machine learning and computer vision beyond the traditional data analyst scope, these skills add valuable depth. The internship's requirement for strong communication and teamwork is consistent with his collaborative project work. Overall, Abhishek is a great fit for the internship position.",
    "message": "Hi Abhishek, I came across your profile and noticed your strong skills in data science and analytics. We have exciting Data Analyst Intern positions open at HUMAN INITIALS that I believe align perfectly with your background and passion for data-driven projects. Would you be interested in learning more about this opportunity?",
    "link": "https://www.shine.com/jobs/data-analyst-intern/human-initials/17981517?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Data Analyst Intern",
    "company": "GRG India",
    "score": 85,
    "reason": "Abhishek Tiwari, currently pursuing a B.Tech in Computer Science with a focus on Data Science, possesses strong analytical skills and relevant experience in data analysis, Python, SQL, and Power BI. The internship at GRG India requires similar skills, including data cleaning, visualization, and reporting, which align well with Abhishek's background and projects. His familiarity with machine learning and data visualization tools is an added advantage. The main gaps are the need for on-site work in Mumbai, 75% travel willingness, and proficiency in specific Excel functions, which seem manageable given his profile.",
    "message": "Hi Abhishek, your background in Data Science and hands-on experience with Python, SQL, and Power BI make you a strong fit for the Data Analyst Intern role at GRG India. This opportunity offers great exposure to real business data and mentorship in a dynamic SaaS environment. Would you like me to connect you with the recruiter?",
    "link": "https://in.indeed.com/viewjob?jk=f992e398ebac4089&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Data Analyst (Intern)",
    "company": "Cisco India",
    "score": 85,
    "reason": "Abhishek's background in data science, machine learning, and data analysis aligns well with the Data Analyst internship role at Cisco India. His proficiency in Python, SQL, and data visualization tools such as Power BI matches the requirement for strong data analytics and visualization skills. Additionally, his experience with projects involving data-driven insights and technical skills in cloud tools supports handling large datasets and complex data architectures. While the candidate shows strong technical competence, direct experience in supply chain data or enterprise data management is not explicitly mentioned, which could be an area to develop further for this specific role.",
    "message": "Hi Abhishek, I came across your profile and was impressed by your expertise in data science and analytics. We have an exciting Data Analyst internship at Cisco India that aligns well with your skills in Python, SQL, and data visualization. I’d love to connect and share more about this opportunity.",
    "link": "https://jobs.weekday.works/cisco-india-data-analyst-(intern)?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  },
  {
    "title": "Data Analytics Internship in Vadodara",
    "company": "Vezapp Solutions LLP",
    "score": 85,
    "reason": "Abhishek has strong data science and data analysis skills, including proficiency in SQL and experience with data-driven projects, which aligns well with the responsibilities of designing dashboards, writing MySQL queries, and ensuring data accuracy at Vezapp Solutions LLP. His Python and analytical background will support collaboration with business teams on KPIs and reporting. While Looker Studio experience is not explicitly mentioned, his exposure to Power BI and cloud tools suggests strong adaptability to BI platforms.",
    "message": "Hi Abhishek, I came across a Data Analytics Internship at Vezapp Solutions LLP in Vadodara that aligns well with your skills in SQL, data analysis, and dashboard development. Your background in data science and hands-on project experience would be a great fit for their mission to digitize manufacturing processes. Would you be interested in learning more about this opportunity?",
    "link": "https://in.linkedin.com/jobs/view/data-analytics-internship-in-vadodara-at-vezapp-solutions-llp-4339331605?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
  }
]